HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxFlash_bf.h
/** \\brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_LEN (1)

/** \\brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_OFF (4)

/** \\brief  Length for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_LEN (19)

/** \\brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_MSK (0x7ffff)

/** \\brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_OFF (5)

/** \\brief  Length for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_OFF (31)

/** \\brief  Length for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_LEN (6)

/** \\brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_OFF (24)

/** \\brief  Length for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_LEN (1)

/** \\brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_OFF (30)

/** \\brief  Length for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_OFF (31)

/** \\brief  Length for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_OFF (30)

/** \\brief  Length for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_LEN (22)

/** \\brief  Mask for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_OFF (0)

/** \\brief  Length for Ifx_FLASH_ECCRD_Bits.RED */
#define IFX_FLASH_ECCRD_RED_LEN (2)

/** \\brief  Mask for Ifx_FLASH_ECCRD_Bits.RED */
#define IFX_FLASH_ECCRD_RED_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_ECCRD_Bits.RED */
#define IFX_FLASH_ECCRD_RED_OFF (22)

/** \\brief  Length for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_OFF (31)

/** \\brief  Length for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_OFF (30)

/** \\brief  Length for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_LEN (22)

/** \\brief  Mask for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_OFF (0)

/** \\brief  Length for Ifx_FLASH_ECCRP_Bits.RED */
#define IFX_FLASH_ECCRP_RED_LEN (2)

/** \\brief  Mask for Ifx_FLASH_ECCRP_Bits.RED */
#define IFX_FLASH_ECCRP_RED_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_ECCRP_Bits.RED */
#define IFX_FLASH_ECCRP_RED_OFF (22)

/** \\brief  Length for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_OFF (30)

/** \\brief  Length for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_OFF (31)

/** \\brief  Length for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_LEN (22)

/** \\brief  Mask for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_OFF (0)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_OFF (31)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_OFF (16)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.FSISTART */
#define IFX_FLASH_FCON_FSISTART_LEN (2)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.FSISTART */
#define IFX_FLASH_FCON_FSISTART_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.FSISTART */
#define IFX_FLASH_FCON_FSISTART_OFF (20)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_OFF (15)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_OFF (18)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_OFF (30)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_MSK (0x1)

