HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxFlash_bf.h
/** \\brief  Offset for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_OFF (26)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.REC */
#define IFX_FLASH_FCON_REC_LEN (2)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.REC */
#define IFX_FLASH_FCON_REC_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.REC */
#define IFX_FLASH_FCON_REC_OFF (22)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_OFF (17)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_OFF (25)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_OFF (19)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_OFF (24)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_LEN (6)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_OFF (6)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_LEN (3)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_MSK (0x7)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_OFF (12)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_LEN (2)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_OFF (4)

/** \\brief  Length for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_LEN (4)

/** \\brief  Mask for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_MSK (0xf)

/** \\brief  Offset for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_OFF (0)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_OFF (16)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_OFF (20)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_OFF (17)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_OFF (18)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_LEN (2)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_OFF (22)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_OFF (3)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_OFF (9)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_OFF (1)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_OFF (2)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_OFF (8)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_OFF (10)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINHSMCFG */
#define IFX_FLASH_FPRO_PROINHSMCFG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINHSMCFG */
#define IFX_FLASH_FPRO_PROINHSMCFG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINHSMCFG */
#define IFX_FLASH_FPRO_PROINHSMCFG_OFF (5)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_LEN (1)

