HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxFlash_bf.h
/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_OFF (4)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINIFX */
#define IFX_FLASH_FPRO_PROINIFX_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINIFX */
#define IFX_FLASH_FPRO_PROINIFX_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINIFX */
#define IFX_FLASH_FPRO_PROINIFX_OFF (7)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_OFF (6)

/** \\brief  Length for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_OFF (0)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.CFU */
#define IFX_FLASH_FSR_CFU_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.CFU */
#define IFX_FLASH_FSR_CFU_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.CFU */
#define IFX_FLASH_FSR_CFU_OFF (31)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_OFF (1)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.D1BUSY */
#define IFX_FLASH_FSR_D1BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.D1BUSY */
#define IFX_FLASH_FSR_D1BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.D1BUSY */
#define IFX_FLASH_FSR_D1BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_OFF (19)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_OFF (21)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_OFF (10)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_OFF (18)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_OFF (20)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_OFF (8)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_OFF (26)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_OFF (0)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_OFF (11)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_OFF (30)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_OFF (3)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_OFF (4)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_OFF (15)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_OFF (16)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_OFF (9)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_OFF (14)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_LEN (1)

