HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxFlash_bf.h
/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_OFF (13)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_OFF (7)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_OFF (25)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.REC */
#define IFX_FLASH_FSR_REC_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.REC */
#define IFX_FLASH_FSR_REC_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.REC */
#define IFX_FLASH_FSR_REC_OFF (24)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_OFF (17)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_OFF (5)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_OFF (6)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_OFF (28)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_OFF (27)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_OFF (12)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_OFF (22)

/** \\brief  Length for Ifx_FLASH_FSR_Bits.VIS */
#define IFX_FLASH_FSR_VIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_FSR_Bits.VIS */
#define IFX_FLASH_FSR_VIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_FSR_Bits.VIS */
#define IFX_FLASH_FSR_VIS_OFF (29)

/** \\brief  Length for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_OFF (31)

/** \\brief  Length for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_LEN (2)

/** \\brief  Mask for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_OFF (0)

/** \\brief  Length for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_OFF (25)

/** \\brief  Length for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_OFF (24)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_OFF (10)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_OFF (8)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_OFF (26)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_OFF (11)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_OFF (7)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_LEN (1)

